#+PROPERTY: header-args:python :results output raw  :noweb no-export :exports code

* Introduction
  Here we'll explore actual consumption decisions made by some very
  poor households drawn from a set of villages in South India studied
  by the International Crops Research Institute for the Semi-Arid
  Tropics (ICRISAT) starting in the mid-seventies, and continuing
  (irregularly) up to 2004.  Data are drawn from a sample of
  households in each of six different villages.

* Consumption Expenditures from Schedule L
   We can collect detailed consumption expenditure items by examining
   Schedule L, with its system of double-accounting.  Here the account
   code for food is 71 ("including milk, sweets and spices"), and the
   account code for "Narcotics, tea, coffee, tobacco, pan, alcoholic
   beverages" is 72.  Other sorts of expenditures related to
   consumption are in accounts 71--79, as follows:

#+attr_latex: :align |r|p{0.8\textwidth}|
| Acct | Consumption Category                                                                                                                           |
|------+------------------------------------------------------------------------------------------------------------------------------------------------|
|   71 | Food (codes) including milk, sweets and spices                                                                                                 |
|   72 | Narcotics, tea, coffee, tobacco, pan, alcoholic beverages                                                                                      |
|   73 | Clothing, sewing of cloth, other tailoring expenses, thread, needles, chappals and other footwear (purchase and repair), etc., (no item codes) |
|   74 | Medicines, cosmetics, soap, barber service (no item codes)                                                                                     |
|   75 | Travel and entertainment, (no item codes)                                                                                                      |
|   76 | Electricity, water charges and cooking fuels (like kerosene, match box) for household use, (no item codes)                                     |
|   77 | Labor expenses for domestic work, (no item codes)                                                                                              |
|   78 | Ceremonial expenses (including Kapur, Gulal, Agarbathi, etc.)                                                                                  |
|   79 | Edible oils and fats (other than ghee) (no item code)                                                                                          |
|   70 | Others, including complete meals in hotel, school and educational materials, stamps, stationery, grinding and milling charges etc.             |

Different kinds of food and narcotics are coded according to
[[food_codes]], along with account codes for those accounts that have no
item codes.
   #+attr_latex: :environment longtable :align |p{.4\textwidth}|l|p{0.4\textwidth}|
   #+name: food_codes
   | Food                                                          | Code | Preferred label                                               |
   |---------------------------------------------------------------+------+---------------------------------------------------------------|
   | Bajra/Pearl millet (Local variety)                            | CA   | Bajra/Pearl Millet                                            |
   | Bajra/Pearl millet (HYV)                                      | CB   | Bajra/Pearl Millet                                            |
   | Jowar/Sorghum (Local variety)                                 | CC   | Jowar/Sorghum                                                 |
   | Jowar/Sorghum (HYV)                                           | CD   | Jowar/Sorghum                                                 |
   | Maize (Local variety)                                         | CE   | Maize                                                         |
   | Maize (HYV)                                                   | CF   | Maize                                                         |
   | Ragi/Finger millet                                            | CG   | Ragi/Finger Millet                                            |
   | Other minor millets                                           | CH   | Other Minor Millets                                           |
   | Paddy (Local variety)                                         | CJ   | Paddy                                                         |
   | Paddy (HYV)                                                   | CK   | Paddy                                                         |
   | Wheat (Local variety)                                         | CL   | Wheat                                                         |
   | Wheat (HYV)                                                   | CM   | Wheat                                                         |
   | Rice (local variety)                                          | CN   | Rice                                                          |
   | Rice (HYV variety)                                            | CP   | Rice                                                          |
   | Meals                                                         | CQ   | Meals                                                         |
   | Other cereals                                                 | CX   | Other Cereals                                                 |
   | Redgram (Tur)/Pigeonpea                                       | PA   | Redgram (Tur)/Pigeonpea                                       |
   | Greengram (Mung)                                              | PB   | Greengram (Mung)                                              |
   | Blackgram (Urad)                                              | PC   | Blackgram (Urad)                                              |
   | Bengalgram (Chenna)/Chickpea                                  | PD   | Bengalgram (Chenna)/Chickpea                                  |
   | Redgram dhal                                                  | PF   | Redgram Dhal                                                  |
   | Greengram dhal                                                | PG   | Greengram Dhal                                                |
   | Blackgram dhal                                                | PH   | Blackgram Dhal                                                |
   | Bengalgram dhal                                               | PJ   | Bengalgram Dhal                                               |
   | Guar                                                          | PK   | Guar                                                          |
   | Cowpea                                                        | PL   | Cowpea                                                        |
   | Soybean                                                       | PN   | Soybean                                                       |
   | Other pulses                                                  | PX   | Other Pulses                                                  |
   | Other dhal                                                    | PZ   | Other Dhal                                                    |
   | Groundnuts                                                    | BA   | Groundnuts                                                    |
   | Sesamum                                                       | BB   | Sesamum                                                       |
   | Castor                                                        | BC   | Castor                                                        |
   | Mustard                                                       | BD   | Mustard                                                       |
   | Linseed                                                       | BE   | Linseed                                                       |
   | Linseed Oil                                                   | BL   | Edible Oils                                                   |
   | Castor (HYV)                                                  | BM   | Castor                                                        |
   | Sunflower                                                     | BF   | Sunflower                                                     |
   | Safflower                                                     | BG   | Safflower                                                     |
   | Safflower oil                                                 | BS   | Edible Oils                                                   |
   | Groundnut oil                                                 | BH   | Edible Oils                                                   |
   | Other oilseeds                                                | BX   | Other Oilseeds                                                |
   | Cotton (Local variety)                                        | DA   | Cotton                                                        |
   | Cotton (HYV)                                                  | DB   | Cotton                                                        |
   | Other Fiber crops                                             | DX   | Other Fiber Crops                                             |
   | Sugarcane                                                     | SA   | Sugarcane                                                     |
   | Sugar                                                         | SB   | Sugar                                                         |
   | Gur (jaggery)                                                 | ZG   | Gur (Jaggery)                                                 |
   | Other sugar products                                          | SX   | Other Sugar Products                                          |
   | Onion                                                         | VA   | Onion                                                         |
   | Chillies                                                      | VB   | Chillies                                                      |
   | Brinjal                                                       | VC   | Brinjal                                                       |
   | Cabbage                                                       | VD   | Cabbage                                                       |
   | Tomato                                                        | VE   | Tomato                                                        |
   | Cauliflower                                                   | VF   | Cauliflower                                                   |
   | Leafy vegetables                                              | VL   | Leafy Vegetables                                              |
   | Potato                                                        | VP   | Potato                                                        |
   | Carrot and Radish                                             | VR   | Carrot & Radish                                               |
   | Fennel                                                        | VS   | Fennel                                                        |
   | Tubers                                                        | VT   | Tubers                                                        |
   | Other vegetables                                              | VX   | Other Vegetables                                              |
   | Other spices                                                  | VY   | Other Spices                                                  |
   | Grapes                                                        | FA   | Grapes                                                        |
   | Lemon                                                         | FB   | Lemon                                                         |
   | Orange                                                        | FC   | Orange                                                        |
   | Mango                                                         | FD   | Mango                                                         |
   | Coconut                                                       | FE   | Coconut                                                       |
   | Toddy Trees                                                   | FG   | Toddy Trees                                                   |
   | Other Fruits                                                  | FX   | Other Fruits                                                  |
   | Banana                                                        | FH   | Banana                                                        |
   | Papaya                                                        | FP   | Papaya                                                        |
   | Alcoholic beverages                                           | NA   | Alcoholic beverages                                           |
   | Coffee                                                        | NC   | Coffee                                                        |
   | Tea                                                           | NT   | Tea                                                           |
   | Tobacco, beedi                                                | NN   | Tobacco, Beedi                                                |
   | Pan, betel, etc.                                              | NP   | Pan, Betel, etc.                                              |
   | Others (Ganja, etc.)                                          | NZ   | Others (Ganja, etc.)                                          |
   | Milk                                                          | AM   | Milk                                                          |
   | Ghee                                                          | AG   | Ghee                                                          |
   | Other milk products like curd, etc.                           | AP   | Other Milk Products Like Curd, etc.                           |
   | Dung cakes                                                    | AC   | Dung                                                          |
   | Dung, manure                                                  | AD   | Dung                                                          |
   | Skin, hide, bones                                             | AS   | Skin, Hide, Bones                                             |
   | Wool, goat hair, etc.                                         | AW   | Wool, Goat Hair, etc.                                         |
   | Eggs                                                          | AY   | Eggs                                                          |
   | Other animal products                                         | AX   | Other Animal Products                                         |
   | Fish                                                          | AF   | Fish                                                          |
   | Bullocks                                                      | LA   | Beef                                                          |
   | Cow                                                           | LB   | Beef                                                          |
   | Young Cattle (under 3 years)                                  | LC   | Beef                                                          |
   | He buffalo                                                    | LD   | Buffalo                                                       |
   | She buffalo                                                   | LE   | Buffalo                                                       |
   | Young buffalo (under 3 years)                                 | LF   | Buffalo                                                       |
   | Horse                                                         | LG   | Horse                                                         |
   | Donkey                                                        | LH   | Donkey                                                        |
   | Goat                                                          | LK   | Goat                                                          |
   | Sheep                                                         | LM   | Sheep                                                         |
   | Pig                                                           | LP   | Pig                                                           |
   | Poultry birds                                                 | LQ   | Poultry Birds                                                 |
   | Other livestock                                               | LZ   | Other livestock                                               |
   | Medicine Doctor's fees                                        | NM   | Medicine Doctor's fees                                        |
   | Cosmetics tooth paste etc.                                    | NB   | Cosmetics tooth paste etc.                                    |
   | Soap, washing powder                                          | NS   | Soap, washing powder                                          |
   | Barber service (and material relating to it)                  | ND   | Barber service (and material relating to it)                  |
   | Other personal                                                | NZ   | Other personal                                                |
   | Complete meals in hotel                                       | GM   | Complete meals in hotel                                       |
   | Educational expenses (fees)                                   | GS   | Educational expenses (fees)                                   |
   | Educational material expenses (pen, books, paper, etc.)       | GE   | Educational material expenses (pen, books, paper, etc.)       |
   | Grinding/milling charges                                      | GG   | Grinding/milling charges                                      |
   | Processed foods (e.g. biscuits Khara, syrup, baby food, etc.) | GP   | Processed foods (e.g. biscuits Khara, syrup, baby food, etc.) |
   | Other consumption                                             | GZ   | Other consumption                                             |
   | Other Food                                                    | 71   | Other Food                                                    |
   | Other Narcotics                                               | 72   | Other Narcotics                                               |
   | Clothing                                                      | 73   | Clothing                                                      |
   | Other Clothing                                                | QK   | Other Clothing                                                |
   | Medicine, cosmetics, etc.                                     | 74   | Medicine, cosmetics, etc.                                     |
   | Travel & Entertainment                                        | 75   | Travel & Entertainment                                        |
   | Utilities                                                     | 76   | Utilities                                                     |
   | Domestic labor                                                | 77   | Domestic labor                                                |
   | Ceremonial expenses                                           | 78   | Ceremonial expenses                                           |
   | Edible oils                                                   | 79   | Edible Oils                                                   |
   | Other                                                         | 70   | Other                                                         |

** Column Specifications for Schedule L
#+begin_src python :tangle l.py
import pandas as pd
from collections import OrderedDict

Ldict =[('village', (2,3),  str),
        ('landclas',(3,4),  int),
        ('hhno',    (4,6),  int),
        ('year',    (6,7),  int),
        ('dayofint',(7,10), int),
        ('accrec',  (10,12),int),
        ('itmcode1',(12,14),str),
        ('itmcode2',(14,15),str),
        ('unit1',   (15,16),str),
        ('gdsoutq', (16,22),int),
        ('monvain', (22,28),float),
        ('accpay',  (29,31),int),
        ('itmcode3',(31,33),str),
        ('itmcode4',(33,34),str),
        ('unit2',   (34,35),str),
        ('gdsinq',  (35,41),int),
        ('monvaout',(41,48),float),
        ('distance',(48,50),float),
        ('partner', (50,51),str),
        ('kincast', (51,53),str),
        ('etc',     (53,57),str)]

Ldict = OrderedDict(sorted([(s[0],((s[1][0]-1,s[1][1]-1),s[2])) for s in Ldict], key = lambda t: t[1][0][0]))
Lcols = OrderedDict(sorted([(s[0],s[1][0]) for s in Ldict.items()], key = lambda t: t[1][0]))
Ltypes = {k:v[1] for k,v in Ldict.items()}

L = [pd.read_fwf('~/Data/VLS/MyVLS/VLS1/L/%s' % v,list(Lcols.values()),dtype=Ltypes) for v in ['aur','shi','kan']]

L[0].columns = list(Ldict.keys())
L[1].columns = list(Ldict.keys())
L[2].columns = list(Ldict.keys())

L = pd.concat(L)

# Clean up some garbage in accpay column
L.accpay = pd.to_numeric(L.accpay,errors='coerce')

# Deal with  a few lowercase codes
L.itmcode3 = L.itmcode3.str.upper()

# Create unique household ID
L['HHID'] = ['%s%d' % l for l in zip(L.village,L.hhno.fillna(0))]

L.to_pickle('l.df')

#+end_src

#+results:

** Expenditures and Quantities
#+begin_src python :var codes=food_codes :tangle expenditures.py
import numpy as np
import pandas as pd
from cfe.df_utils import orgtbl_to_df, df_to_orgtbl

L = pd.read_pickle('l.df')

# Uncomment to use most disaggregate classication
#d = {v[1]:v[0] for v in codes}
d = {v[1]:v[2] for v in codes} # Slightly aggregated

Consumption = L.query('70 <= accpay < 80')[['village','HHID','year','accpay','itmcode3','unit2','gdsinq','monvaout']]

# Replace Nans in itmcode3 with accpay number
Consumption.itmcode3.fillna(Consumption.accpay,inplace=True)
del Consumption['accpay']

# Clean up some non-numeric garbage
Consumption.monvaout = Consumption.monvaout.astype(float)

# Similarly for quantities
Consumption.gdsinq = Consumption.gdsinq.astype(float)

X = Consumption.groupby(['village','year','HHID','itmcode3'])['monvaout'].sum()

Q = Consumption.groupby(['village','year','HHID','itmcode3','unit2'])['gdsinq'].sum()

Units = {'Q':'Quintal',
         'L':'Kilograms', # On theory of fluid weight being roughly 1kg/l
         'l':'Kilograms',
         'C':'Hundreds',
         'T':'Cubic feet',
         'M':'Meters',
         'K':'Kilograms',
         'k':'Kilograms',
         'N':'Number',
         'A':'Acres',
         'H':'Hours',
         'S':'Square feet',
         '.':'Rs',  # The following are not valid unit codes,  but may be in rupees.
         '1':'Rs',
         '5':'Rs',
         'G':'Rs'}

# Fix year indicators
X.rename({0.:80,1:81,2:82,3:83,4:84,5:75,6:76,7:77,8:78,9:79},level='year',inplace=True)
Q.rename({0.:80,1:81,2:82,3:83,4:84,5:75,6:76,7:77,8:78,9:79},level='year',inplace=True)

X = X.unstack('itmcode3').rename(columns=d).stack('itmcode3')

X.index = X.index.reorder_levels(['HHID','year','village','itmcode3'])
X.index.names = ['j','t','m','i']
X = X.groupby(['j','t','m','i']).sum() # Add similar categories

X = X.unstack('i')

X.to_pickle('x.df')

y = np.log(X.replace(0,np.nan))

#y.index.names = ['m','t','j']
#y = y.reorder_levels(['j','t','m'])

y.to_pickle('y.df')

##
Q = Q.unstack('itmcode3').rename(columns=d).stack('itmcode3')

Q.index = Q.index.reorder_levels(['HHID','year','village','unit2','itmcode3'])
Q.index.names = ['j','t','m','u','i']
Q = Q.groupby(['j','t','m','u','i']).sum() # Add similar categories

Q.rename(index=Units,level='u',inplace=True)
Q = Q.replace(0,np.nan)

# Repeat because units renamed, not bijective
Q = Q.groupby(['j','t','m','u','i']).sum() # Add similar categories

Q = Q.unstack(['i'])

Q.to_pickle('q.df')

# Print counts of observations of different items
print(df_to_orgtbl((Q>0).sum().sort_values(ascending=False),float_fmt="%d"))
#+end_src

#+results:
| i                                                             |    0 |
|---------------------------------------------------------------+------|
| Utilities                                                     | 1875 |
| Jowar/Sorghum                                                 | 1191 |
| Rice                                                          | 1046 |
| Bengalgram Dhal                                               | 1029 |
| Redgram Dhal                                                  | 1014 |
| Milk                                                          | 1012 |
| Wheat                                                         |  991 |
| Chillies                                                      |  987 |
| Edible Oils                                                   |  973 |
| Gur (Jaggery)                                                 |  946 |
| Onion                                                         |  890 |
| Cosmetics tooth paste etc.                                    |  866 |
| Sugar                                                         |  822 |
| Other Spices                                                  |  810 |
| Goat                                                          |  798 |
| Brinjal                                                       |  794 |
| Tea                                                           |  779 |
| Other Vegetables                                              |  774 |
| Coconut                                                       |  678 |
| Tobacco, Beedi                                                |  541 |
| Tomato                                                        |  471 |
| Groundnuts                                                    |  438 |
| Other Dhal                                                    |  429 |
| Processed foods (e.g. biscuits Khara, syrup, baby food, etc.) |  390 |
| Paddy                                                         |  371 |
| Other Fruits                                                  |  363 |
| Other consumption                                             |  360 |
| Eggs                                                          |  330 |
| Bajra/Pearl Millet                                            |  286 |
| Greengram Dhal                                                |  283 |
| Mango                                                         |  262 |
| Ghee                                                          |  262 |
| Soap, washing powder                                          |  260 |
| Poultry Birds                                                 |  248 |
| Fish                                                          |  244 |
| Greengram (Mung)                                              |  235 |
| Redgram (Tur)/Pigeonpea                                       |  220 |
| Other Pulses                                                  |  196 |
| Blackgram (Urad)                                              |  190 |
| Bengalgram (Chenna)/Chickpea                                  |  189 |
| Castor                                                        |  181 |
| Cabbage                                                       |  181 |
| Maize                                                         |  178 |
| Pan, Betel, etc.                                              |  163 |
| Ceremonial expenses                                           |  161 |
| Other Sugar Products                                          |  108 |
| Beef                                                          |   95 |
| Blackgram Dhal                                                |   89 |
| Other Narcotics                                               |   65 |
| Medicine, cosmetics, etc.                                     |   47 |
| Sheep                                                         |   45 |
| Other Cereals                                                 |   43 |
| Other Minor Millets                                           |   37 |
| Lemon                                                         |   35 |
| Sesamum                                                       |   34 |
| Clothing                                                      |   30 |
| Cowpea                                                        |   25 |
| Leafy Vegetables                                              |   24 |
| Safflower                                                     |   23 |
| Orange                                                        |   23 |
| Other Food                                                    |   21 |
| Grapes                                                        |   18 |
| Educational material expenses (pen, books, paper, etc.)       |   16 |
| Sugarcane                                                     |   16 |
| Cotton                                                        |   15 |
| Other Milk Products Like Curd, etc.                           |   15 |
| Potato                                                        |   14 |
| Coffee                                                        |   11 |
| Sunflower                                                     |   10 |
| ZK                                                            |    9 |
| Mustard                                                       |    9 |
| Other livestock                                               |    9 |
| Banana                                                        |    7 |
| Buffalo                                                       |    7 |
| Grinding/milling charges                                      |    6 |
| KQ                                                            |    6 |
| YK                                                            |    6 |
| BK                                                            |    5 |
| Linseed                                                       |    5 |
| ZF                                                            |    4 |
| Other personal                                                |    4 |
| Meals                                                         |    3 |
| Barber service (and material relating to it)                  |    3 |
| Travel & Entertainment                                        |    3 |
| QJ                                                            |    3 |
| EY                                                            |    3 |
| HB                                                            |    3 |
| Other Animal Products                                         |    2 |
| ZJ                                                            |    2 |
| Other Fiber Crops                                             |    2 |
| KJ                                                            |    2 |
| Ragi/Finger Millet                                            |    2 |
| LN                                                            |    2 |
| QC                                                            |    2 |
| AN                                                            |    2 |
| AB                                                            |    2 |
| CV                                                            |    2 |
| BN                                                            |    1 |
| Medicine Doctor's fees                                        |    1 |
| LY                                                            |    1 |
| AV                                                            |    1 |
| VM                                                            |    1 |
| ZB                                                            |    1 |
| ZA                                                            |    1 |
| YZ                                                            |    1 |
| KL                                                            |    1 |
| YB                                                            |    1 |
| Wool, Goat Hair, etc.                                         |    1 |
| 5B                                                            |    1 |
| 4K                                                            |    1 |
| Soybean                                                       |    1 |
| UB                                                            |    1 |
| IF                                                            |    1 |
| Other Oilseeds                                                |    1 |
| Other                                                         |    1 |
| NR                                                            |    1 |
| GJ                                                            |    1 |
| GD                                                            |    1 |
| GB                                                            |    1 |
| PP                                                            |    1 |
| Fennel                                                        |    1 |
| FF                                                            |    1 |
| Pig                                                           |    1 |
| QF                                                            |    1 |
| ES                                                            |    1 |
| HP                                                            |    1 |
| RF                                                            |    1 |
| SG                                                            |    1 |
| SN                                                            |    1 |
| SR                                                            |    1 |
| 2G                                                            |    1 |





* Food Conversion (to nutrients)
  Alessandro Tarozzi provides a mapping from foods reported in the
  68th round of the NSS data into nutritional outcomes, using
  nutritive values from cite:gopalan-etal80.  Identifying foods
  consumed in the ICRISAT data which correspond to foods in the NSS
  data is mostly straight-forward.
** ICRISAT Foods to NSS 68 Food Codes

#+name: icrisat2nss
#+attr_latex: :environment longtable :align |p{0.4\textwidth}|r|p{0.4\textwidth}|
| ICRISAT Food Label                    | Code | Food Label                             |
|---------------------------------------+------+----------------------------------------|
| Edible oils                           |  185 | Edible Oils                            |
| Fish                                  |  191 | Fish                                   |
| Ghee                                  |  164 | Ghee                                   |
| Milk                                  |  160 | Milk                                   |
| "Other milk products like curd, etc." |  163 | "Other milk products like curd, etc."  |
| Eggs                                  |  190 | Eggs                                   |
| Groundnuts                            |  241 | Groundnuts                             |
| Sesamum                               |  260 | Sesamum                                |
| Mustard                               |  181 | Mustard                                |
| Linseed                               |  185 | Linseed                                |
| Sunflower                             |  184 | Sunflower                              |
| Safflower                             |  184 | Safflower                              |
| Groundnut oil                         |  182 | Edible Oils                            |
| Linseed Oil                           |  185 | Edible Oils                            |
| Safflower oil                         |  184 | Edible Oils                            |
| Other oilseeds                        |  260 | Other Oilseeds                         |
| Bajra/Pearl millet (Local variety)    |  116 | Bajra/Pearl Millet                     |
| Bajra/Pearl millet (HYV)              |  116 | Bajra/Pearl Millet                     |
| Jowar/Sorghum (Local variety)         |  115 | Jowar/Sorghum                          |
| Jowar/Sorghum (HYV)                   |  115 | Jowar/Sorghum                          |
| Maize (Local variety)                 |  117 | Maize                                  |
| Maize (HYV)                           |  117 | Maize                                  |
| Ragi/Finger millet                    |  121 | Ragi/Finger Millet                     |
| Other minor millets                   |  120 | Other Minor Millets                    |
| Paddy (Local variety)                 |  102 | Rice                                   |
| Paddy (HYV)                           |  102 | Rice                                   |
| Wheat (Local variety)                 |  108 | Wheat                                  |
| Wheat (HYV)                           |  108 | Wheat                                  |
| Rice (local variety)                  |  102 | Rice                                   |
| Rice (HYV variety)                    |  102 | Rice                                   |
| Meals                                 |  280 | Meals                                  |
| Other cereals                         |  122 | Other Cereals                          |
| Grapes                                |  237 | Grapes                                 |
| Lemon                                 |  216 | Lemon                                  |
| Orange                                |  228 | Orange                                 |
| Mango                                 |  231 | Mango                                  |
| Coconut                               |  224 | Coconut                                |
| Banana                                |  220 | Banana                                 |
| Other Fruits                          |  238 | Other Fruits                           |
| Complete meals in hotel               |  280 | Complete meals in hotel                |
| Various processed foods               |  296 | Various processed foods                |
| Bullocks                              |  193 | Beef                                   |
| Cow                                   |  193 | Beef                                   |
| Young Cattle (under 3 years)          |  193 | Beef                                   |
| He buffalo                            |  193 | Buffalo                                |
| She buffalo                           |  193 | Buffalo                                |
| Goat                                  |  192 | Goat                                   |
| Sheep                                 |  192 | Sheep                                  |
| Pig                                   |  194 | Pig                                    |
| Poultry birds                         |  195 | Poultry Birds                          |
| Coffee                                |  272 | Coffee                                 |
| "Pan, betel, etc."                    |  301 | "Pan, betel, etc."                     |
| Tea                                   |  271 | Tea                                    |
| Redgram (Tur)/Pigeonpea               |  142 | Redgram (Tur)/Pigeonpea                |
| Greengram (Mung)                      |  143 | Greengram (Mung)                       |
| Blackgram (Urad)                      |  142 | Blackgram (Urad)                       |
| Bengalgram (Chenna)/Chickpea          |  142 | Bengalgram (Chenna)/Chickpea           |
| Redgram dhal                          |  142 | Redgram Dhal                           |
| Greengram dhal                        |  143 | Greengram Dhal                         |
| Blackgram dhal                        |  142 | Blackgram Dhal                         |
| Bengalgram dhal                       |  142 | Bengalgram Dhal                        |
| Cowpea                                |  146 | Cowpea                                 |
| Soybean                               |  148 | Soybean                                |
| Other pulses                          |  148 | Other Pulses                           |
| Other dhal                            |  148 | Other Dhal                             |
| Sugarcane                             |  172 | Sugarcane                              |
| Sugar                                 |  172 | Sugar                                  |
| Other sugar products                  |  172 | Other Sugar Products                   |
| Onion                                 |  201 | Onion                                  |
| Chillies                              |  207 | Chillies                               |
| Brinjal                               |  203 | Brinjal                                |
| Cabbage                               |  212 | Cabbage                                |
| Tomato                                |  202 | Tomato                                 |
| Leafy vegetables                      |  206 | Leafy vegetables                       |
| Potato                                |  200 | Potato                                 |
| Fennel                                |  261 | Fennel                                 |
| Other vegetables                      |  217 | Other Vegetables                       |
| Other spices                          |  261 | Other Spices                           |
| Gur (jaggery)                         |  173 | Gur (Jaggery)                          |


** NSS 68 Food Codes
#+name: nss68codes
#+attr_latex: :environment longtable :align |p{0.8\textwidth}|r|
| NSS68 Items                                        | Code |
|----------------------------------------------------+------|
| apple                                              |  236 |
| arhar, tur                                         |  140 |
| baby food                                          |  161 |
| bajra & products                                   |  116 |
| banana                                             |  220 |
| barley & products                                  |  118 |
| beef/ buffalo meat                                 |  193 |
| beer                                               |  323 |
| berries                                            |  234 |
| besan                                              |  151 |
| biscuits, chocolates (rural)                       |  291 |
| biscuits, chocolates (urban)                       |  291 |
| black pepper                                       |  255 |
| bread (bakery)                                     |  113 |
| brinjal                                            |  203 |
| butter                                             |  165 |
| cabbage                                            |  212 |
| cake, pastry, prepared sweets (rural)              |  290 |
| cake, pastry, prepared sweets (urban)              |  290 |
| candy, misri                                       |  174 |
| carrot                                             |  205 |
| cashewnut                                          |  243 |
| cauliflower                                        |  211 |
| cereal substitutes (tapioca, jackfruit seed, etc.) |  139 |
| chicken                                            |  195 |
| chillis: green                                     |  207 |
| chips                                              |  293 |
| chira                                              |  103 |
| coconut                                            |  224 |
| coconut oil                                        |  183 |
| coconut, copra                                     |  240 |
| coconut: green                                     |  225 |
| coffee : cups                                      |  272 |
| coffee: powder                                     |  273 |
| cold beverages: bottled/canned                     |  275 |
| cooked meals purchased                             |  280 |
| cooked meals received as assistance                |  281 |
| cooked meals received free in workplace            |  282 |
| cooked snacks purchased [samosa, puri, paratha,    |  283 |
| cooked snacks purchased [samosa, puri, paratha,    |  283 |
| country liquor                                     |  322 |
| curd                                               |  163 |
| curry powder                                       |  258 |
| dates                                              |  242 |
| dhania                                             |  253 |
| dry chillies                                       |  256 |
| edible oil: others                                 |  185 |
| eggs                                               |  190 |
| fish, prawn                                        |  191 |
| foreign/ refined liquor or wine                    |  324 |
| french beans, barbati                              |  215 |
| fruit juice and shake                              |  276 |
| garlic                                             |  251 |
| ghee                                               |  164 |
| ginger                                             |  250 |
| goat meat/mutton                                   |  192 |
| gourd, pumpkin                                     |  213 |
| gram (split)                                       |  141 |
| gram (whole)                                       |  142 |
| gram products                                      |  150 |
| grapes                                             |  237 |
| groundnut                                          |  241 |
| groundnut oil                                      |  182 |
| guava                                              |  226 |
| gur                                                |  173 |
| honey                                              |  175 |
| ice-cream (rural)                                  |  166 |
| ice-cream (urban)                                  |  166 |
| ingredients for pan                                |  302 |
| jackfruit                                          |  221 |
| jeera                                              |  252 |
| jowar & products                                   |  115 |
| kharbooza                                          |  232 |
| khesari                                            |  147 |
| khoi, lawa                                         |  104 |
| lady?s finger                                      |  208 |
| leechi                                             |  235 |
| lemon                                              |  216 |
| maida                                              |  110 |
| maize & products                                   |  117 |
| mango                                              |  231 |
| masur                                              |  144 |
| milk : condensed/ powder                           |  162 |
| milk: liquid                                       |  160 |
| moong                                              |  143 |
| muri                                               |  105 |
| mustard oil                                        |  181 |
| oilseeds                                           |  260 |
| onion                                              |  201 |
| orange, mausami                                    |  228 |
| other beverages: cocoa, chocolate etc. (rural)     |  277 |
| other beverages: cocoa, etc. (urban)               |  278 |
| other cereals                                      |  122 |
| other dry fruits                                   |  247 |
| other fresh fruits (rural)                         |  238 |
| other fresh fruits (urban)                         |  238 |
| other milk products (rural)                        |  167 |
| other milk products (urban)                        |  167 |
| other nuts                                         |  245 |
| other packaged processed food (rural)              |  296 |
| other packaged processed food (urban)              |  296 |
| other pulse products                               |  152 |
| other pulses                                       |  148 |
| other rice products                                |  106 |
| other served processed food (rural)                |  284 |
| other served processed food (urban)                |  284 |
| other spices                                       |  261 |
| other vegetables (rural)                           |  217 |
| other vegetables (urban)                           |  217 |
| other wheat products                               |  114 |
| others: birds, crab, oyster, tortoise etc.         |  196 |
| palak/other leafy vegetables                       |  206 |
| pan: finished                                      |  301 |
| pan: leaf                                          |  300 |
| papad, bhujia, namkeen, mixture, chanachur         |  292 |
| papad, bhujia, namkeen, mixture, chanachur         |  292 |
| papaya                                             |  230 |
| parwal, patal/kundru                               |  210 |
| pears, naspati                                     |  233 |
| peas                                               |  146 |
| peas                                               |  214 |
| pickles                                            |  294 |
| pineapple                                          |  223 |
| pork                                               |  194 |
| potato (includes sweet potato and green plantain)  |  200 |
| radish                                             |  204 |
| ragi & products                                    |  121 |
| raisin, kishmish, monacca, etc.                    |  246 |
| refined oil [sunflower, soyabean, saffola, etc.]   |  184 |
| rice  PDS                                      |  101 |
| rice  other sources                            |  102 |
| sauce, jam, jelly                                  |  295 |
| sewai, noodles                                     |  112 |
| singara                                            |  227 |
| small millets & products                           |  120 |
| sugar  PDS                                     |  171 |
| sugar  other sources                           |  172 |
| suji, rawa                                         |  111 |
| tamarind                                           |  257 |
| tea : cups                                         |  270 |
| tea : leaf                                         |  271 |
| toddy                                              |  321 |
| tomato                                             |  202 |
| turmeric                                           |  254 |
| urd                                                |  145 |
| vanaspati, margarine                               |  180 |
| walnut                                             |  244 |
| watermelon                                         |  222 |
| wheat/atta  PDS                                |  107 |
| wheat/atta  other sources                      |  108 |

** ICRISAT Food Conversion Tables

   Combining the mapping from ICRISAT foods to NSS 68 codes, one can
   then calculate nutritional content for ICRISAT foods.
#+begin_src python :var foodcodes = icrisat2nss :colnames no :tangle fooditems.py
from cfe.df_utils import orgtbl_to_df, df_to_orgtbl
import pandas as pd

foodcodes = orgtbl_to_df(foodcodes).set_index('Code')

nss68 = pd.read_stata('~/Data/NSS/OriginalData/Food2Nutrition/nss68list.dta').set_index('id_item_68')
nss68.index.name = "Code"
nss68.rename(columns={'item':'NSS Item'},inplace=True)

Units = {'kg':'Kilograms',
         'gm':'Grams',
         'no.':'Number',
         'Re':'Rupees',
         'litre':'Kilograms'}

nss68['unit'].replace(Units,inplace=True)

nutrients = ['protein', 'fat', 'fibre', 'carbohydrate', 'energy_kcal', 'energy_kj',
             'calcium', 'iron', 'betacarotene', 'caroten_total', 'thiamine',
             'riboflavin', 'niacin', 'ascorbic_total', 'ext_source', 'pu_cal',
             'pu_prot', 'pu_fat']

fooditems = nss68[['NSS Item']].join(foodcodes,how='right')
print(df_to_orgtbl(fooditems.reset_index(),float_fmt='%d'))

fct = foodcodes.join(nss68) # ICRISAT food conversion table
fct.loc[fct.unit=='Grams',nutrients] = fct.loc[fct.unit=='Grams',nutrients]*1000
fct.loc[fct.unit=='Grams','unit'] = 'Kilograms'

fct.loc[fct.unit=='Hundreds',nutrients] = fct.loc[fct.unit=='Hundreds',nutrients]*100
fct.loc[fct.unit=='Hundreds','unit'] = 'Number'

fct = fct.reset_index().set_index(['Food Label','unit'])

fct=fct[~fct.index.duplicated()][nutrients]
fct.to_pickle('fct_units.df')

######### FCT Cleanup #################
# Change some labels
d={'protein':'Protein',
   'protein g':'Protein',
   'fat':'Fat',
   'energy_kcal':'Calories',
   'energy kcal':'Calories',
   'calcium':'Calcium',
   'ca mg':'Calcium',
   'betacarotene':'Betacarotene',
   'thiamine':'Thiamine',
   'riboflavin':'Riboflavin',
   'niacin':'Niacin',
   'iron':'Iron',
   'fe mg':'Iron',
   'ascorbic_total':'Ascorbic Acid',
   'vit a ug':'Vitamin A',
   'vit b6 mg':'Vitamin B6',
   'vit b12 ug':'Vitamin B12',
   'vit d ug':'Vitamin D',
   'vit e ug':'Vitamin E',
   'vit c mg':'Vitamin C',
   'mg mg':'Magnesium',
   'zn mg':'Zinc'}

fct = fct.rename(columns=d)

# Just use nutrients that are in fct
fct = fct[fct.columns.intersection(list(d.values()))]

try:
    fct.index = fct.index.droplevel('unit')
except AttributeError: pass # No units?

# Fix capitalization (to match food labels)
fct.index = fct.reset_index()['Food Label'].str.title()
fct.index.name = 'i'

# Replace missing with zeros
fct = fct.fillna(0)

fct = fct.loc[:,~fct.columns.duplicated()]
#######################################

fct.to_pickle('fct.df')
#+end_src

#+results:
|    | Code | NSS Item                                          | ICRISAT Food Label                  | Food Label                          |
|----+------+---------------------------------------------------+-------------------------------------+-------------------------------------|
|  0 |  102 | rice  other sources                           | Paddy (Local variety)               | Rice                                |
|  1 |  102 | rice  other sources                           | Paddy (HYV)                         | Rice                                |
|  2 |  102 | rice  other sources                           | Rice (local variety)                | Rice                                |
|  3 |  102 | rice  other sources                           | Rice (HYV variety)                  | Rice                                |
|  4 |  108 | wheat/atta  other sources                     | Wheat (Local variety)               | Wheat                               |
|  5 |  108 | wheat/atta  other sources                     | Wheat (HYV)                         | Wheat                               |
|  6 |  115 | jowar & products                                  | Jowar/Sorghum (Local variety)       | Jowar/Sorghum                       |
|  7 |  115 | jowar & products                                  | Jowar/Sorghum (HYV)                 | Jowar/Sorghum                       |
|  8 |  116 | bajra & products                                  | Bajra/Pearl millet (Local variety)  | Bajra/Pearl Millet                  |
|  9 |  116 | bajra & products                                  | Bajra/Pearl millet (HYV)            | Bajra/Pearl Millet                  |
| 10 |  117 | maize & products                                  | Maize (Local variety)               | Maize                               |
| 11 |  117 | maize & products                                  | Maize (HYV)                         | Maize                               |
| 12 |  120 | small millets & products                          | Other minor millets                 | Other Minor Millets                 |
| 13 |  121 | ragi & products                                   | Ragi/Finger millet                  | Ragi/Finger Millet                  |
| 14 |  122 | other cereals                                     | Other cereals                       | Other Cereals                       |
| 15 |  142 | gram (whole)                                      | Redgram (Tur)/Pigeonpea             | Redgram (Tur)/Pigeonpea             |
| 16 |  142 | gram (whole)                                      | Blackgram (Urad)                    | Blackgram (Urad)                    |
| 17 |  142 | gram (whole)                                      | Bengalgram (Chenna)/Chickpea        | Bengalgram (Chenna)/Chickpea        |
| 18 |  142 | gram (whole)                                      | Redgram dhal                        | Redgram Dhal                        |
| 19 |  142 | gram (whole)                                      | Blackgram dhal                      | Blackgram Dhal                      |
| 20 |  142 | gram (whole)                                      | Bengalgram dhal                     | Bengalgram Dhal                     |
| 21 |  143 | moong                                             | Greengram (Mung)                    | Greengram (Mung)                    |
| 22 |  143 | moong                                             | Greengram dhal                      | Greengram Dhal                      |
| 23 |  146 | peas                                              | Cowpea                              | Cowpea                              |
| 24 |  148 | other pulses                                      | Soybean                             | Soybean                             |
| 25 |  148 | other pulses                                      | Other pulses                        | Other Pulses                        |
| 26 |  148 | other pulses                                      | Other dhal                          | Other Dhal                          |
| 27 |  160 | milk: liquid                                      | Milk                                | Milk                                |
| 28 |  163 | curd                                              | Other milk products like curd, etc. | Other milk products like curd, etc. |
| 29 |  164 | ghee                                              | Ghee                                | Ghee                                |
| 30 |  172 | sugar  other sources                          | Sugarcane                           | Sugarcane                           |
| 31 |  172 | sugar  other sources                          | Sugar                               | Sugar                               |
| 32 |  172 | sugar  other sources                          | Other sugar products                | Other Sugar Products                |
| 33 |  173 | gur                                               | Gur (jaggery)                       | Gur (Jaggery)                       |
| 34 |  181 | mustard oil                                       | Mustard                             | Mustard                             |
| 35 |  182 | groundnut oil                                     | Groundnut oil                       | Edible Oils                         |
| 36 |  184 | refined oil [sunflower, soyabean, saffola, etc.]  | Sunflower                           | Sunflower                           |
| 37 |  184 | refined oil [sunflower, soyabean, saffola, etc.]  | Safflower                           | Safflower                           |
| 38 |  184 | refined oil [sunflower, soyabean, saffola, etc.]  | Safflower oil                       | Edible Oils                         |
| 39 |  185 | edible oil: others                                | Edible oils                         | Edible Oils                         |
| 40 |  185 | edible oil: others                                | Linseed                             | Linseed                             |
| 41 |  185 | edible oil: others                                | Linseed Oil                         | Edible Oils                         |
| 42 |  190 | eggs                                              | Eggs                                | Eggs                                |
| 43 |  191 | fish, prawn                                       | Fish                                | Fish                                |
| 44 |  192 | goat meat/mutton                                  | Goat                                | Goat                                |
| 45 |  192 | goat meat/mutton                                  | Sheep                               | Sheep                               |
| 46 |  193 | beef/ buffalo meat                                | Bullocks                            | Beef                                |
| 47 |  193 | beef/ buffalo meat                                | Cow                                 | Beef                                |
| 48 |  193 | beef/ buffalo meat                                | Young Cattle (under 3 years)        | Beef                                |
| 49 |  193 | beef/ buffalo meat                                | He buffalo                          | Buffalo                             |
| 50 |  193 | beef/ buffalo meat                                | She buffalo                         | Buffalo                             |
| 51 |  194 | pork                                              | Pig                                 | Pig                                 |
| 52 |  195 | chicken                                           | Poultry birds                       | Poultry Birds                       |
| 53 |  200 | potato (includes sweet potato and green plantain) | Potato                              | Potato                              |
| 54 |  201 | onion                                             | Onion                               | Onion                               |
| 55 |  202 | tomato                                            | Tomato                              | Tomato                              |
| 56 |  203 | brinjal                                           | Brinjal                             | Brinjal                             |
| 57 |  206 | palak/other leafy vegetables                      | Leafy vegetables                    | Leafy vegetables                    |
| 58 |  207 | chillis: green                                    | Chillies                            | Chillies                            |
| 59 |  212 | cabbage                                           | Cabbage                             | Cabbage                             |
| 60 |  216 | lemon                                             | Lemon                               | Lemon                               |
| 61 |  217 | other vegetables (rural)                          | Other vegetables                    | Other Vegetables                    |
| 62 |  217 | other vegetables (urban)                          | Other vegetables                    | Other Vegetables                    |
| 63 |  220 | banana                                            | Banana                              | Banana                              |
| 64 |  224 | coconut                                           | Coconut                             | Coconut                             |
| 65 |  228 | orange, mausami                                   | Orange                              | Orange                              |
| 66 |  231 | mango                                             | Mango                               | Mango                               |
| 67 |  237 | grapes                                            | Grapes                              | Grapes                              |
| 68 |  238 | other fresh fruits (rural)                        | Other Fruits                        | Other Fruits                        |
| 69 |  238 | other fresh fruits (urban)                        | Other Fruits                        | Other Fruits                        |
| 70 |  241 | groundnut                                         | Groundnuts                          | Groundnuts                          |
| 71 |  260 | oilseeds                                          | Sesamum                             | Sesamum                             |
| 72 |  260 | oilseeds                                          | Other oilseeds                      | Other Oilseeds                      |
| 73 |  261 | other spices                                      | Fennel                              | Fennel                              |
| 74 |  261 | other spices                                      | Other spices                        | Other Spices                        |
| 75 |  271 | tea : leaf                                        | Tea                                 | Tea                                 |
| 76 |  272 | coffee : cups                                     | Coffee                              | Coffee                              |
| 77 |  280 | cooked meals purchased                            | Meals                               | Meals                               |
| 78 |  280 | cooked meals purchased                            | Complete meals in hotel             | Complete meals in hotel             |
| 79 |  296 | other packaged processed food (rural)             | Various processed foods             | Various processed foods             |
| 80 |  296 | other packaged processed food (urban)             | Various processed foods             | Various processed foods             |
| 81 |  301 | pan: finished                                     | Pan, betel, etc.                    | Pan, betel, etc.                    |





#+name: tab:nss_and_icrisat_foods
#+attr_latex: :environment longtable :align |r|p{0.3\textwidth}|p{0.3\textwidth}||p{0.3\textwidth}|
| Code | NSS Item                                          | ICRISAT Food Label                  | Food Label                          |
|------+---------------------------------------------------+-------------------------------------+-------------------------------------|
|  102 | rice  other sources                           | Paddy (Local variety)               | Rice                                |
|  102 | rice  other sources                           | Paddy (HYV)                         | Rice                                |
|  102 | rice  other sources                           | Rice (local variety)                | Rice                                |
|  102 | rice  other sources                           | Rice (HYV variety)                  | Rice                                |
|  108 | wheat/atta  other sources                     | Wheat (Local variety)               | Wheat                               |
|  108 | wheat/atta  other sources                     | Wheat (HYV)                         | Wheat                               |
|  115 | jowar & products                                  | Jowar/Sorghum (Local variety)       | Jowar/Sorghum                       |
|  115 | jowar & products                                  | Jowar/Sorghum (HYV)                 | Jowar/Sorghum                       |
|  116 | bajra & products                                  | Bajra/Pearl millet (Local variety)  | Bajra/Pearl Millet                  |
|  116 | bajra & products                                  | Bajra/Pearl millet (HYV)            | Bajra/Pearl Millet                  |
|  117 | maize & products                                  | Maize (Local variety)               | Maize                               |
|  117 | maize & products                                  | Maize (HYV)                         | Maize                               |
|  120 | small millets & products                          | Other minor millets                 | Other Minor Millets                 |
|  121 | ragi & products                                   | Ragi/Finger millet                  | Ragi/Finger Millet                  |
|  122 | other cereals                                     | Other cereals                       | Other Cereals                       |
|  142 | gram (whole)                                      | Redgram (Tur)/Pigeonpea             | Redgram (Tur)/Pigeonpea             |
|  142 | gram (whole)                                      | Blackgram (Urad)                    | Blackgram (Urad)                    |
|  142 | gram (whole)                                      | Bengalgram (Chenna)/Chickpea        | Bengalgram (Chenna)/Chickpea        |
|  142 | gram (whole)                                      | Redgram dhal                        | Redgram Dhal                        |
|  142 | gram (whole)                                      | Blackgram dhal                      | Blackgram Dhal                      |
|  142 | gram (whole)                                      | Bengalgram dhal                     | Bengalgram Dhal                     |
|  143 | moong                                             | Greengram (Mung)                    | Greengram (Mung)                    |
|  143 | moong                                             | Greengram dhal                      | Greengram Dhal                      |
|  146 | peas                                              | Cowpea                              | Cowpea                              |
|  148 | other pulses                                      | Soybean                             | Soybean                             |
|  148 | other pulses                                      | Other pulses                        | Other Pulses                        |
|  148 | other pulses                                      | Other dhal                          | Other Dhal                          |
|  160 | milk: liquid                                      | Milk                                | Milk                                |
|  163 | curd                                              | Other milk products like curd, etc. | Other milk products like curd, etc. |
|  164 | ghee                                              | Ghee                                | Ghee                                |
|  172 | sugar  other sources                          | Sugarcane                           | Sugarcane                           |
|  172 | sugar  other sources                          | Sugar                               | Sugar                               |
|  172 | sugar  other sources                          | Other sugar products                | Other Sugar Products                |
|  173 | gur                                               | Gur (jaggery)                       | Gur (Jaggery)                       |
|  181 | mustard oil                                       | Mustard                             | Mustard                             |
|  182 | groundnut oil                                     | Groundnut oil                       | Edible Oils                         |
|  184 | refined oil [sunflower, soyabean, saffola, etc.]  | Sunflower                           | Sunflower                           |
|  184 | refined oil [sunflower, soyabean, saffola, etc.]  | Safflower                           | Safflower                           |
|  184 | refined oil [sunflower, soyabean, saffola, etc.]  | Safflower oil                       | Edible Oils                         |
|  185 | edible oil: others                                | Edible oils                         | Edible Oils                         |
|  185 | edible oil: others                                | Linseed                             | Linseed                             |
|  185 | edible oil: others                                | Linseed Oil                         | Edible Oils                         |
|  190 | eggs                                              | Eggs                                | Eggs                                |
|  191 | fish, prawn                                       | Fish                                | Fish                                |
|  192 | goat meat/mutton                                  | Goat                                | Goat                                |
|  192 | goat meat/mutton                                  | Sheep                               | Sheep                               |
|  193 | beef/ buffalo meat                                | Bullocks                            | Beef                                |
|  193 | beef/ buffalo meat                                | Cow                                 | Beef                                |
|  193 | beef/ buffalo meat                                | Young Cattle (under 3 years)        | Beef                                |
|  193 | beef/ buffalo meat                                | He buffalo                          | Buffalo                             |
|  193 | beef/ buffalo meat                                | She buffalo                         | Buffalo                             |
|  194 | pork                                              | Pig                                 | Pig                                 |
|  195 | chicken                                           | Poultry birds                       | Poultry Birds                       |
|  200 | potato (includes sweet potato and green plantain) | Potato                              | Potato                              |
|  201 | onion                                             | Onion                               | Onion                               |
|  202 | tomato                                            | Tomato                              | Tomato                              |
|  203 | brinjal                                           | Brinjal                             | Brinjal                             |
|  206 | palak/other leafy vegetables                      | Leafy vegetables                    | Leafy vegetables                    |
|  207 | chillis: green                                    | Chillies                            | Chillies                            |
|  212 | cabbage                                           | Cabbage                             | Cabbage                             |
|  216 | lemon                                             | Lemon                               | Lemon                               |
|  217 | other vegetables (rural)                          | Other vegetables                    | Other Vegetables                    |
|  217 | other vegetables (urban)                          | Other vegetables                    | Other Vegetables                    |
|  220 | banana                                            | Banana                              | Banana                              |
|  224 | coconut                                           | Coconut                             | Coconut                             |
|  228 | orange, mausami                                   | Orange                              | Orange                              |
|  231 | mango                                             | Mango                               | Mango                               |
|  237 | grapes                                            | Grapes                              | Grapes                              |
|  238 | other fresh fruits (rural)                        | Other Fruits                        | Other Fruits                        |
|  238 | other fresh fruits (urban)                        | Other Fruits                        | Other Fruits                        |
|  241 | groundnut                                         | Groundnuts                          | Groundnuts                          |
|  260 | oilseeds                                          | Sesamum                             | Sesamum                             |
|  260 | oilseeds                                          | Other oilseeds                      | Other Oilseeds                      |
|  261 | other spices                                      | Fennel                              | Fennel                              |
|  261 | other spices                                      | Other spices                        | Other Spices                        |
|  271 | tea : leaf                                        | Tea                                 | Tea                                 |
|  272 | coffee : cups                                     | Coffee                              | Coffee                              |
|  280 | cooked meals purchased                            | Meals                               | Meals                               |
|  280 | cooked meals purchased                            | Complete meals in hotel             | Complete meals in hotel             |
|  296 | other packaged processed food (rural)             | Various processed foods             | Various processed foods             |
|  296 | other packaged processed food (urban)             | Various processed foods             | Various processed foods             |
|  301 | pan: finished                                     | Pan, betel, etc.                    | Pan, betel, etc.                    |







** Calculate ICRISAT Nutrients & Standardized Quantities
#+begin_src python :tangle nutrients.py
import pandas as pd
import numpy as np

def prices(Q,X,tol=1e-6):
    """Impute prices from data on expenditures and quantities.

    Non-trivial because quantities may be reported in different units.
    """
    myQ = Q.groupby(['j','t','m','u']).sum()

    B={}
    for t in myQ.index.levels[1]:
        for m in myQ.index.levels[2]:
            for i in myQ.columns:
                useX = X.query("t==%d and m=='%s'" % (t,m))[i].fillna(0)
                useQ = myQ.query("t==%d and m=='%s'" % (t,m))[i].fillna(0).unstack('u')
                if len(useX):
                    q,x = useQ.fillna(0).align(useX.fillna(0),axis=0,join='inner')
                    b = np.linalg.lstsq(q,x,rcond=None)[0]
                    b = pd.Series(b,index=q.columns,name=i)
                    B[(t,m,i)] = b.where(b>0,0).round(6)

    P = pd.concat(B).replace(0,np.nan).dropna()
    P.index.names = ['t','m','i','u']

    P = P.unstack(['i','u'])
    
    return P


def quantities(X,P,tol=1e-6):
    """
    Return standardized quantities from expenditures & prices.

    Inputs are:
        - X :: DataFrame of expenditures, with index (j,t,m)
        - P :: DataFrame of prices, with index (i,u,m,t)
               and columns (i,m,t).
    """

    Q={}
    for t in X.index.levels[1]:
        for m in X.index.levels[2]:
            useX = X.query("t==%d and m=='%s'" % (t,m)).fillna(0)
            try:
                useP = P.xs((t,m)).fillna(0).unstack('u')
                myX, myP = useX.align(useP.T,axis=1,join='inner')
                myX.fillna(0,inplace=True)
                myP.fillna(0,inplace=True)
                if len(useX):
                    myQ = np.linalg.lstsq(myP.T,myX.T)
                    myQ = pd.DataFrame(myQ,index=myP[1].columns,columns=myP[1].index)
                    myQ = myQ.loc[:,(myQ > tol).sum()>1]
                    Q[(t,m)] = myQ
            except KeyError: pass

    return Q

def nutrition(fct,Q,tol=1e-6):
    """Compute household nutritional intake.

    Inputs:

     - fct :: food conversion DataFrame with index of food
              labels and units, and columns nutrients.

     - Q :: Dictionary of DataFrames with keys (t,m'); each DataFrame
            is Food quantities, index of j, columns (i, u).
    """

    N = {}
    for k in Q.keys():
        baz = Q[k].align(fct.T,axis=1,join='inner')

        myN = baz[0].fillna(0)@baz[1].fillna(0).T
        N[k] = myN.loc[myN.sum(axis=1)>tol,:]

    return N

Q = pd.read_pickle('q.df')
X = pd.read_pickle('x.df')

X.columns.name = 'i'
#Q.columns.name = 'i'
    
fct = pd.read_pickle('fct_units.df')
fct.index.names = ['i','u']

P = prices(Q,X,tol=1e-6)

# Get prices using units in fct:
myP = P.T.align(fct,axis=0,join='right')[0].T

myP0 = myP.copy()
#myP0.columns = myP0.columns.droplevel('u')

myP0 = myP0.dropna(how='all')
myP0 = myP0.stack('u')
myP0.to_pickle('prices.df')

#Qhat = quantities(X,P)

#Qhat.to_pickle('qhat.df')

# Nutrients per day
#N = {k:n/365 for k,n in nutrition(fct,Qhat).items()}

#N = pd.concat(N.values())

#N.to_pickle('nutrients.df')

#N.head()
#+end_src

#+results:

* Impute quantities
#+begin_src python :tangle /tmp/quantities.py
import pandas as pd
import numpy as np

def quantities(X,P,tol=1e-6):
    """
    Return standardized quantities from expenditures & prices.

    Inputs are:
        - X :: DataFrame of expenditures, with index (j,t,m)
        - P :: DataFrame of prices, with index (i,unit,m,t)
               and columns (i,m,t).
    """

    Q={}
    for t in X.index.levels[1]:
        for m in X.index.levels[2]:
            useX = X.query("t==%d and m=='%s'" % (t,m)).fillna(0)
            try:
                useP = P.xs((t,m)).fillna(0).unstack('u')
                myX, myP = useX.align(useP.T,axis=1,join='inner')
                myX.fillna(0,inplace=True)
                myP.fillna(0,inplace=True)
                myQ = {}
                if len(useX):
                    #myQ = np.linalg.lstsq(myP.T,myX.T,rcond=None)[0]
                    # X(Nxn) = Q(Nxn)@P(nxk) => Q = XP^+
                    Pinv = pd.DataFrame(np.linalg.pinv(myP),index=myX.columns,columns=myP.index)
                    for u in Pinv:
                        myQ[u] = myX.mul(Pinv[u])
                    myQ = pd.concat(myQ,names='u').unstack('u')
                    myQ = myQ.loc[:,(myQ > tol).sum()>1]
                    Q[(t,m)] = myQ
            except KeyError: pass

    return pd.concat(Q)

P = pd.read_pickle('./prices.df')
X = pd.read_pickle('./x.df')

Q = quantities(X,P,tol=1e-6)
Q.to_pickle('altq.df')
#+end_src

#+results:

* Demographics from Schedule C
#+begin_src python :tangle c.py
import numpy as np
import pandas as pd
from collections import OrderedDict

r0 = pd.read_csv('~/Data/VLS/MyVLS/VLS1/Chicago/sc.raw',delimiter="\s+",
                 header=None,skiprows=filter(lambda x: x % 6 != 0,range(81924)),
                 names=['village','class','hhno','year','dayofint','member','rltohd'])

r1 = pd.read_csv('~/Data/VLS/MyVLS/VLS1/Chicago/sc.raw',delimiter="\s+",
                 header=None,skiprows=filter(lambda x: x % 6 != 1,range(81924)),
                 names=['sex','age','marst','educ','yrended','mocc','socc'])

C = pd.concat([r0,r1],axis=1)

# Create unique household ID
C.village.replace(to_replace={1:'A',2:'B',3:'C',4:'D',5:'E',6:'F'},inplace=True)
C.sex.replace(to_replace={6:'F',13:'M'},inplace=True)

C['HHID'] = ['%s%d' % l for l in zip(C.village,C.hhno.fillna(0))]
del C['hhno']

#| Nutrition                      | Source | C 1-3 | F 4-8 | M 4-8 | F 9-13 | M 9-13 | F 14-18 | M 14-18 | F 19-30 | M 19-30 | F 31-50 | M 31-50 | F 51+ | M 51+ |

agesex = ['C 0-0.5', 'C 0.5-1', 'C 1-3', 'C 4-6', 'C 7-9',
          'B 10-12', 'B 13-15', 'B 16-17',
          'G 10-12', 'G 13-15', 'G 16-17',
          'M','W']

C['C 0-0.5'] = C['age'] <= 0.5
C['C 0.5-1'] = (C['age'] > 0.5) & (C['age'] <= 1)
C['C 1-3'] = (C['age'] > 1) & (C['age'] <= 3)
C['C 4-6'] = (C['age'] > 3) & (C['age'] <= 6)
C['C 7-9'] = (C['age'] > 6) & (C['age'] <= 9)

C['B 10-12'] = (C['sex']=='M') & (C['age'] > 9) & (C['age'] <= 12)
C['G 10-12'] = (C['sex']=='F') & (C['age'] > 9) & (C['age'] <= 12)

C['B 13-15'] = (C['sex']=='M') & (C['age'] > 12) & (C['age'] <= 15)
C['G 13-15'] = (C['sex']=='F') & (C['age'] > 12) & (C['age'] <= 15)

C['B 16-17'] = (C['sex']=='M') & (C['age'] > 15) & (C['age'] <= 17)
C['G 16-17'] = (C['sex']=='F') & (C['age'] > 15) & (C['age'] <= 17)

C['M'] = (C['sex']=='M') & (C['age'] > 17) 
C['W'] = (C['sex']=='F') & (C['age'] > 17) 

C.to_pickle('c.df')

z = C.groupby(['village','year','HHID'])[agesex].sum() #['Men','Women','Boys','Girls']].sum()
z['log Hsize'] = np.log(z.sum(axis=1))

z.index.names = ['m','t','j']
z = z.reorder_levels(['j','t','m'])

z.to_pickle('z.df')

#+end_src

#+results:



* Nutritional needs of households

#+name: rda
| Sex-Age | Calories | Protein | Fat | Calcium | Iron | Betacarotene | Thiamine | Riboflavin | Niacin | Ascorbic Acid |
|---------+----------+---------+-----+---------+------+--------------+----------+------------+--------+---------------|
| C 0-0.5 |          |         |     |     500 |      |              |       .2 |         .3 |        |            25 |
| C 0.5-1 |          |         |  19 |     500 |    5 |         2800 |       .3 |         .4 |        |            25 |
| C 1-3   |     1060 |    16.7 |  27 |     600 |    9 |         3200 |       .5 |         .6 |      8 |            40 |
| C 4-6   |     1350 |    20.1 |  25 |     600 |   13 |         3200 |       .7 |         .8 |     11 |            40 |
| C 7-9   |     1690 |    29.5 |  30 |     600 |   16 |         4800 |       .8 |         1. |     13 |            40 |
| B 10-12 |     2190 |    39.9 |  35 |     800 |   21 |         4800 |      1.1 |        1.3 |     15 |            40 |
| G 10-12 |     2010 |    40.4 |  35 |     800 |   27 |         4800 |       1. |        1.2 |     13 |            40 |
| B 13-15 |     2750 |    54.3 |  45 |     800 |   32 |         4800 |      1.4 |        1.6 |     16 |            40 |
| G 13-15 |     2330 |    51.9 |  40 |     800 |   27 |         4800 |      1.2 |        1.4 |     14 |            40 |
| B 16-17 |     3020 |    61.5 |  50 |     800 |   28 |         4800 |      1.5 |        1.8 |     17 |            40 |
| G 16-17 |     2440 |    55.5 |  35 |     800 |   26 |         4800 |       1. |        1.2 |     14 |            40 |
| M       |     2730 |      60 |  30 |     600 |   17 |         4800 |      1.4 |        1.4 |     18 |            40 |
| W       |     2230 |      55 |  25 |    1200 |   21 |         4800 |      1.1 |        1.3 |     14 |            40 |



* Write DataFrames to google sheet
#+begin_src python :results output :var user="instructors@eep153.iam.gserviceaccount.com" spread_fn="13Ig5hZif-NSHtgkKRp_cEgKXk0lOsdUB2BAD6O_FnRo"
import pandas as pd
import numpy as np
from gspread_pandas import Client, Spread
from gspread_pandas.client import SpreadsheetNotFound

client = Client()

try:
    spread = Spread(spread_fn,client=client)
except SpreadsheetNotFound:
    client.create(spread_fn)
    spread = Spread(spread_fn,client=client)
    spread.delete_sheet('Sheet1')

y = pd.read_pickle('y.df')
q = pd.read_pickle('q.df')
z = pd.read_pickle('z.df')
p = pd.read_pickle('prices.df')

spread.df_to_sheet(np.exp(y),sheet="Expenditures")
spread.df_to_sheet(z,sheet="HH Characteristics")
spread.df_to_sheet(q,sheet="Consumption")
spread.df_to_sheet(p,sheet="Prices")
spread.df_to_sheet(pd.read_pickle('fct.df'),sheet="FCT")
spread.df_to_sheet(pd.read_pickle('../HackingFood/IndianICRISAT/rda.df'),sheet="RDI")

print(spread.sheets)

#+end_src

#+results:
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'Prices' id:369222129>, <Worksheet 'FCT' id:814160050>, <Worksheet 'RDI' id:396245996>]
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'FCT' id:936160040>, <Worksheet 'Prices' id:369222129>]
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'FCT' id:936160040>, <Worksheet 'Prices' id:369222129>]
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'FCT' id:936160040>, <Worksheet 'Prices' id:369222129>]
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'FCT' id:936160040>, <Worksheet 'Prices' id:369222129>]
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'FCT' id:936160040>, <Worksheet 'Prices' id:369222129>]
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'FCT' id:936160040>]
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'FCT' id:936160040>]


* Estimating Demands
#+begin_src python :tangle estimation.py
import pandas as pd
import cfe
import numpy as np

q = pd.read_pickle('q.df')

z = pd.read_pickle('z.df')

y = pd.read_pickle('y.df')

y = y.query("m in ['A','C','E']")

y = y.loc[:,y.count()>10]

prices = pd.read_pickle('prices.df')
prices = prices.loc[:,prices.columns.isin(q.columns)]
prices = prices.groupby(['t','u']).median()

#y = np.log(pd.read_pickle('q.df').replace(0,np.nan))

# Treat as single unit
y = y.reset_index()
y['m']='SAT'
y = y.set_index(['j','t','m'])

q = q.reset_index()
q['m']='SAT'
q = q.set_index(['j','t','m','u'])

z = z.reset_index()
z['m']='SAT'
z = z.set_index(['j','t','m'])

prices = prices.reset_index()
prices['m'] = 'SAT'
prices = prices.set_index(['t','m','u'])

result = cfe.Result(y=y,z=z,prices=prices,verbose=True)
#result = cfe.Result(y=y,z=z,verbose=True)

result.get_predicted_log_expenditures()
result.get_loglambdas()
result.get_alpha()

result.to_dataset('icrisat.ds')

#print(cfe.df_utils.df_to_orgtbl(result.beta.to_dataframe().sort_values('beta',ascending=False)))
#+end_src

#+results:
min_proportion_items test drops 274 households.
Dropping Coffee.
Dropping Cotton.
Dropping Cowpea.
Dropping Grapes.
Dropping Other.
Dropping Other Food.
Dropping Other Milk Products Like Curd, etc..
Dropping Other livestock.
Dropping Potato.
Dropping QC.
Dropping Safflower.
Dropping ZK.
Dropping QJ.
Dropping Meals.
Dropping Sheep.
Dropping GN.
Dropping Sesamum.
Dropping Other Cereals.
Dropping Orange.
Dropping Other Minor Millets.
Dropping Leafy Vegetables.
Dropping Castor.
Dropping Blackgram Dhal.
Dropping Medicine, cosmetics, etc..
Dropping Beef.
Dropping Lemon.
Dropping Other Clothing.
Dropping Other Pulses.
Dropping Maize.
Dropping Cabbage.
Dropping Sugarcane.
Dropping Blackgram (Urad).
Dropping Greengram (Mung).
Dropping Bengalgram (Chenna)/Chickpea.
Dropping Educational expenses (fees).
Dropping Redgram (Tur)/Pigeonpea.
Dropping Greengram Dhal.
drop_columns_wo_covariance test drops 0 households and 37 goods.
good in every (t,m) test drops 0 households and 16 goods.
min_proportion_items test drops 274 households.
Dropping Coffee.
Dropping Cotton.
Dropping Cowpea.
Dropping Grapes.
Dropping Other.
Dropping Other Food.
Dropping Other livestock.
Dropping Other milk products like curd, etc..
Dropping Potato.
Dropping QC.
Dropping Safflower.
Dropping ZK.
Dropping QJ.
Dropping Meals.
Dropping Sheep.
Dropping GN.
Dropping Sesamum.
Dropping Other cereals.
Dropping Orange.
Dropping Other minor millets.
Dropping Leafy vegetables.
Dropping Castor.
Dropping Blackgram dhal.
Dropping Medicine, cosmetics, etc..
Dropping Beef.
Dropping Lemon.
Dropping Other Clothing.
Dropping Other pulses.
Dropping Maize.
Dropping Cabbage.
Dropping Sugarcane.
Dropping Blackgram (Urad).
Dropping Greengram (Mung).
Dropping Bengalgram (Chenna)/Chickpea.
Dropping Educational expenses (fees).
Dropping Redgram (Tur)/Pigeonpea.
Dropping Greengram dhal.
drop_columns_wo_covariance test drops 0 households and 37 goods.
good in every (t,m) test drops 0 households and 16 goods.

#+begin_src ipython
print(result.prices.coords['i'])
print(result.prices.sel(t=75,m='A'))
#print(prices.sel(t=75,m='A',i=result.prices.coords['i']))
#+end_src

#+results:
:results:
# Out[13]:
# output
<xarray.DataArray 'i' (i: 26)>
array(['Bengalgram dhal', 'Ceremonial expenses', 'Chillies', 'Clothing',
       'Coconut', 'Complete meals in hotel', 'Cosmetics tooth paste etc.',
       'Edible oils',
       'Educational material expenses (pen, books, paper, etc.)',
       'Grinding/milling charges', 'Gur (jaggery)', 'Jowar/Sorghum',
       "Medicine Doctor's fees", 'Milk', 'Onion', 'Other spices',
       'Other vegetables', 'Pan, betel, etc.', 'Redgram dhal', 'Rice',
       'Soap, washing powder', 'Sugar', 'Tea', 'Tobacco, beedi',
       'Travel & Entertainment', 'Utilities'], dtype=object)
Coordinates:
  * i        (i) object 'Bengalgram dhal' 'Ceremonial expenses' ... 'Utilities'
<xarray.DataArray 'prices' (i: 26)>
array([ 6.855503,       nan,  2.339487,       nan,  1.140172,  1.      ,
             nan,  8.899037,       nan,       nan,  2.428749,  1.344647,
             nan,  2.038483,  0.9723  ,  0.353038,  1.      ,  1.      ,
        5.409195,  1.38935 ,       nan,  3.275923, 14.918605,       nan,
             nan,       nan])
Coordinates:
    m        <U1 'A'
    t        int64 75
  * i        (i) object 'Bengalgram dhal' 'Ceremonial expenses' ... 'Utilities'

:end:


* Write DataFrames to google sheet Mark II
  Same idea, but write results after dropping goods and households in estimation.
#+begin_src python :results output :var user="instructors@eep153.iam.gserviceaccount.com" spread_fn="13Ig5hZif-NSHtgkKRp_cEgKXk0lOsdUB2BAD6O_FnRo"
import pandas as pd
import numpy as np
import cfe
from gspread_pandas import Client, Spread
from gspread_pandas.client import SpreadsheetNotFound

client = Client()

try:
    spread = Spread(spread_fn,client=client)
except SpreadsheetNotFound:
    client.create(spread_fn)
    spread = Spread(spread_fn,client=client)
    spread.delete_sheet('Sheet1')

r = cfe.from_dataset('icrisat.ds')

y = r.y.to_dataframe('').squeeze().unstack('i')
z = r.z.to_dataframe('').squeeze().unstack('k')
p = r.prices.to_dataframe('').squeeze().unstack('i')

x = np.exp(y)

q = pd.read_pickle('q.df')

spread.df_to_sheet(np.exp(y),sheet="Expenditures")
spread.df_to_sheet(z,sheet="HH Characteristics")
spread.df_to_sheet(q,sheet="Consumption")
spread.df_to_sheet(p,sheet="Prices")
spread.df_to_sheet(pd.read_pickle('fct.df'),sheet="FCT")

print(spread.sheets)

#+end_src

#+results:
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'FCT' id:936160040>, <Worksheet 'Prices' id:369222129>]
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'FCT' id:936160040>, <Worksheet 'Prices' id:369222129>]
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'FCT' id:936160040>, <Worksheet 'Prices' id:369222129>]
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'FCT' id:936160040>]
[<Worksheet 'Expenditures' id:744482690>, <Worksheet 'HH Characteristics' id:1760828959>, <Worksheet 'Consumption' id:1987214981>, <Worksheet 'FCT' id:936160040>]



* Expenditures and Nutrients vs. \log\lambda

** Expenditures vs. \log\lambda
   :PROPERTIES:
   :EXPORT_FILE_NAME: exp_vs_loglambda.ipynb
   :END:
#+begin_src ipython
%matplotlib inline
import cfe
import pandas as pd
import matplotlib.pyplot as plt

r0 = cfe.from_dataset('result.ds')

# Turn off variation in household composition
r0['z'] = r0['z']*0

l0 = r0.loglambdas.sel(t=75,m='A')

# Predicted total expenditures given lambda & prices
x0 = r0.get_predicted_expenditures().sum('i').sel(t=75,m='A')

plt.scatter(x0,l0)
plt.show()
#+end_src

** Nutrients
Now consider nutrients:
#+begin_src ipython

Q = r0.get_predicted_expenditures().sel(t=75,m='A',drop=True).to_dataframe('q')
Q = Q.unstack('i')
Q.columns = Q.columns.droplevel(0)

fct = pd.read_pickle('fct.df')

# Intersection of foods in Q and fct0
use = list(set(fct.index.tolist()).intersection(Q.columns))

# Inner product of quantities of food and FCT gives nutrients
N = Q[use].dot(fct.loc[use,:])

# Nutrients per day
N = N.groupby(['j']).sum()/365

pl.scatter(l0,N['pu_prot'])
pl.scatter(l0,N['pu_cal'])
pl.scatter(l0,x0)
pl.legend(['Protein','Calories','Tot. Exp'])
pl.show()

#+end_src


#+begin_src ipython

fct = pd.read_pickle('fct.df')

fct.head()
#+end_src

#+results:
:results:
# Out[6]:
# text/plain
:                           protein   fat       fibre  carbohydrate  \
: ICRISAT Food Label                                                  
: Paddy (Local variety)   78.099998   5.5   37.400002    771.600037   
: Paddy (HYV)             78.099998   5.5   37.400002    771.600037   
: Rice (local variety)    78.099998   5.5   37.400002    771.600037   
: Rice (HYV variety)      78.099998   5.5   37.400002    771.600037   
: Wheat (Local variety)  105.800003  15.0  112.949997    644.449951   
: 
:                        energy_kcal  energy_kj     calcium       iron  \
: ICRISAT Food Label                                                     
: Paddy (Local variety)  3513.423096    14710.0   81.099998   7.200000   
: Paddy (HYV)            3513.423096    14710.0   81.099998   7.200000   
: Rice (local variety)   3513.423096    14710.0   81.099998   7.200000   
: Rice (HYV variety)     3513.423096    14710.0   81.099998   7.200000   
: Wheat (Local variety)  3208.894531    13435.0  351.500000  40.349998   
: 
:                        betacarotene  caroten_total  thiamine  riboflavin  \
: ICRISAT Food Label                                                         
: Paddy (Local variety)           0.0          469.0       1.7         0.6   
: Paddy (HYV)                     0.0          469.0       1.7         0.6   
: Rice (local variety)            0.0          469.0       1.7         0.6   
: Rice (HYV variety)              0.0          469.0       1.7         0.6   
: Wheat (Local variety)          28.5         2840.0       4.4         1.5   
: 
:                        niacin  ascorbic_total  ext_source  pu_cal  pu_prot  \
: ICRISAT Food Label                                                           
: Paddy (Local variety)   25.10             0.0         0.0  3460.0     75.0   
: Paddy (HYV)             25.10             0.0         0.0  3460.0     75.0   
: Rice (local variety)    25.10             0.0         0.0  3460.0     75.0   
: Rice (HYV variety)      25.10             0.0         0.0  3460.0     75.0   
: Wheat (Local variety)   25.25             0.0         0.0  3410.0    121.0   
: 
:                        pu_fat  
: ICRISAT Food Label             
: Paddy (Local variety)     5.0  
: Paddy (HYV)               5.0  
: Rice (local variety)      5.0  
: Rice (HYV variety)        5.0  
: Wheat (Local variety)    17.0  

# text/html
#+BEGIN_EXPORT html
<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>protein</th>
      <th>fat</th>
      <th>fibre</th>
      <th>carbohydrate</th>
      <th>energy_kcal</th>
      <th>energy_kj</th>
      <th>calcium</th>
      <th>iron</th>
      <th>betacarotene</th>
      <th>caroten_total</th>
      <th>thiamine</th>
      <th>riboflavin</th>
      <th>niacin</th>
      <th>ascorbic_total</th>
      <th>ext_source</th>
      <th>pu_cal</th>
      <th>pu_prot</th>
      <th>pu_fat</th>
    </tr>
    <tr>
      <th>ICRISAT Food Label</th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
      <th></th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>Paddy (Local variety)</th>
      <td>78.099998</td>
      <td>5.5</td>
      <td>37.400002</td>
      <td>771.600037</td>
      <td>3513.423096</td>
      <td>14710.0</td>
      <td>81.099998</td>
      <td>7.200000</td>
      <td>0.0</td>
      <td>469.0</td>
      <td>1.7</td>
      <td>0.6</td>
      <td>25.10</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>3460.0</td>
      <td>75.0</td>
      <td>5.0</td>
    </tr>
    <tr>
      <th>Paddy (HYV)</th>
      <td>78.099998</td>
      <td>5.5</td>
      <td>37.400002</td>
      <td>771.600037</td>
      <td>3513.423096</td>
      <td>14710.0</td>
      <td>81.099998</td>
      <td>7.200000</td>
      <td>0.0</td>
      <td>469.0</td>
      <td>1.7</td>
      <td>0.6</td>
      <td>25.10</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>3460.0</td>
      <td>75.0</td>
      <td>5.0</td>
    </tr>
    <tr>
      <th>Rice (local variety)</th>
      <td>78.099998</td>
      <td>5.5</td>
      <td>37.400002</td>
      <td>771.600037</td>
      <td>3513.423096</td>
      <td>14710.0</td>
      <td>81.099998</td>
      <td>7.200000</td>
      <td>0.0</td>
      <td>469.0</td>
      <td>1.7</td>
      <td>0.6</td>
      <td>25.10</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>3460.0</td>
      <td>75.0</td>
      <td>5.0</td>
    </tr>
    <tr>
      <th>Rice (HYV variety)</th>
      <td>78.099998</td>
      <td>5.5</td>
      <td>37.400002</td>
      <td>771.600037</td>
      <td>3513.423096</td>
      <td>14710.0</td>
      <td>81.099998</td>
      <td>7.200000</td>
      <td>0.0</td>
      <td>469.0</td>
      <td>1.7</td>
      <td>0.6</td>
      <td>25.10</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>3460.0</td>
      <td>75.0</td>
      <td>5.0</td>
    </tr>
    <tr>
      <th>Wheat (Local variety)</th>
      <td>105.800003</td>
      <td>15.0</td>
      <td>112.949997</td>
      <td>644.449951</td>
      <td>3208.894531</td>
      <td>13435.0</td>
      <td>351.500000</td>
      <td>40.349998</td>
      <td>28.5</td>
      <td>2840.0</td>
      <td>4.4</td>
      <td>1.5</td>
      <td>25.25</td>
      <td>0.0</td>
      <td>0.0</td>
      <td>3410.0</td>
      <td>121.0</td>
      <td>17.0</td>
    </tr>
  </tbody>
</table>
</div>
#+END_EXPORT
:end:






